// import videojs from "video.js"

const data = [
  {
     id: 4,
    img: require("@/assets/tv/tv4.webp"),
	zongyimg:require("@/assets/zy/zy1.webp"),
	filmimg:require("@/assets/film/film1.webp"),
	dmimg:require("@/assets/dm/dm1.webp"),
	V:require("@/assets/video/tv1.mp4"),
	zongyV:require("@/assets/video/zy1.mp4"),
	zy:require("@/assets/zy/zy1.1.jpg"),
	film:require("@/assets/film/film1.1.jpg"),
	dm:require("@/assets/dm/dm1.1.jpg"),
    name: "我的阿勒泰",
	zongyname:"种地吧第二季",
	dmname:"名侦探柯南",
	filmname:"热辣滚烫",
    desc: "生长在阿勒泰的汉族少女李文秀一心在大城市中追求文学梦想，却屡屡碰壁被迫回到老家与开小卖部的母亲相依为命。在结识哈萨克少年巴太之后，文秀渐渐发现了当地之美。",
	zongydesc:"《种地吧》第二季，农田种植面积扩大，10位少年将解锁全新农业种植领域，提升个人劳动技能，以企业做大做强展现“科技助农，产业兴农”，以脚踏实地的劳动书写当代青年的成长诗歌!",
	filmdesc:"大学毕业后仅仅工作短暂的一段时间，杜乐莹便退回家中，宅家长达十年之久。她无所事事，拒绝和外界做过多接触，甚至和家人的关系也变得紧张起来。在和离婚回到娘家的妹妹乐丹一次激烈的冲突后，乐莹选择离家出走并且在烧烤店找了服务员的工作勉强维生。爱情、亲情人生，似乎一时间均跌入了谷底，而阴差阳错间乐莹又结识了落魄的拳击教练吴坤。她支持着他的梦想，彼此又不得不去面对残酷的现实。人生至暗时刻，随波逐流的女孩是否决心逆流而上?",
	dmdesc:"高中生侦探工藤新一，被称为“日本警察的救世主”、“平成年代的福尔摩斯”。一次在与青梅竹马的女友毛利兰去游乐园游玩时，发现两个行动诡异的黑衣人。新一跟踪他们直到交易现场，另一个黑衣人趁其不注意从后面将他一棒击倒，并灌下一种名为APTX4869的神秘毒药企图杀他灭口，但因为副作用他的身体竟回到发育期的孩童状态。考虑到要是黑衣人知道他还活着的话，必将使周围的亲朋好友受到牵连，于是新一化名为“江户川柯南”，寄住在毛利兰的家中，想借助其父亲、担任侦探的毛利小五郎的力量来找寻黑衣人。"
  },
  {
    id: 2,
    img: require("@/assets/tv/tv2.webp"),
	zongyimg:require("@/assets/zy/zy2.webp"),
	filmimg:require("@/assets/film/film2.webp"),
	dmimg:require("@/assets/dm/dm2.webp"),
	V:require("@/assets/video/tv2.mp4"),
	zy:require("@/assets/zy/zy1.2.jpg"),
	film:require("@/assets/film/film1.2.jpg"),
	dm:require("@/assets/dm/dm1.2.jpg"),
    name: "哈尔滨一九四四",
	zongyname:"种地吧",
	filmname:"维和防暴队",
	dmname:"蜡笔小新第八季",
    desc: "1944年伪满统治下的哈尔滨，伪装成铁路巡的地下党宋卓文，被特务科科长关雪误认为自己的救命恩人--其实是卓文失散多年的双胞胎哥哥宋卓武。卓文为查清关东军课长浅野大吾来哈尔滨的最高任务，将计就计利用关雪进入特务科，可是宋卓武却突然出现，使卓文陷入始料未及的困境。关雪冷血多疑，心狠毒辣，卓武生性冲动，经常无意间破坏卓文的行动，在上级的安排下，才使得两兄弟相互配合，彼此掩护，经历数次的试探，避开特务科内部同事的明争暗斗，终于取得关雪和日方高官的信任。在这短短一年的时间之内，地下党人们经历千辛万苦查清并阻止了日军和苏联共谋的秘密行动，揪出潜伏在我党内部的伪满特务，迎来战争最后的胜利。",
	zongydesc:"这是一个关于汗水、泥土和成长的青春实验故事。10位青春阳光的少年踏实地用180天时间在100亩土地上播种、灌溉、施肥、收获，真实运营农场。少年们随着麦子一同成长，最终见证一粒种子变成麦田，看到废弃荒野变成田园诗歌。",
	filmdesc:"影片聚焦中国维和警察鲜为人知的生死时刻!应联合国请求、受国家派遣，余卫东、杨震、丁慧等维和警察肩负神圣使命，远赴异国他乡，深入战火纷飞的任务区执行维和任务。他们将要直面恐怖袭击、武装暴动、黑帮横行等种种险境，维和行动刻不容缓.." ,
	dmdesc:"小新今年5岁了，不要以为他是那种懵懂无知的小孩，他其实人小鬼大，收养了一条棉花糖一样的流浪狗--小白,还经常讲些无厘头的笑话。小新的妈妈是一个全职主妇粗心而又有点神经质的她经常被小新捉弄得七窍生烟，爸爸野原亦经常被这两母子搞得晕头转向。"
	 },
  {
    id: 3,
    img: require("@/assets/tv/tv3.webp"),
	zongyimg:require("@/assets/zy/zy3.webp"),
	filmimg:require("@/assets/film/film3.webp"),
	dmimg:require("@/assets/dm/dm3.webp"),
	V:require("@/assets/video/tv3.mp4"),
	zy:require("@/assets/zy/zy1.3.jpg"),
	film:require("@/assets/film/film1.3.jpg"),
	dm:require("@/assets/dm/dm1.3.jpg"),
    name: "莲花楼",
	zongyname:"奔跑吧第八季",
	filmname:"飞驰人生2",
	dmname:"海贼王",
    desc: "该剧讲述了闻名武林的四顾门门主李相夷在一次大战后身受重伤，从此退隐江湖成为淡泊名利的“假神医”李莲花，在遇到新交方多病与旧敌笛飞声后重新卷入江湖的故事。江湖暗流涌动，疑团扑朔迷离，抽丝剥茧方能断出真相，段荡气回肠的侠义情即将热血展开。",
	zongydesc:"龙行龘，欢乐无期限!一场自由与热爱碰撞出精彩火花的旅程即将全新开启，一起奔赴春天的盛宴，享受恣意昂扬的奔跑!",
	filmdesc:"五年，三万六千遍，张驰的蓝牙已再次连上。那个不想输的张驰留下了“巴音布鲁克永远的王”的传说，归来的只是身伤病想躺平赚点钱的驾校陪练张驰，可惜天不遂人愿经过众人一番晓之以利动之以钱，张驰和朋友们重组车队，跌跌撞撞地再次奔赴最后一届巴音布鲁克",
	dmdesc:"有个男人，他拥有世界上一切财富、名望和权势，他就是「海盗王」高路德·罗杰。 他在临死前说过这样一句话，让全世界的人都奔向大海:「想要我的财宝吗?想要的话就拿去吧…!你们去找吧!我把世界上的一切都放在那里了」。 后来世界上的人们将这个宝藏称作“大秘宝”(OnePiece)，许多人为了争夺大秘宝One Piece，无数海盗扬起旗帜，互相斗争，后来就形成了「大海盗时代」。主角蒙奇·D·路飞在遥远的路途上找寻着志同道合的伙伴，携手共进「伟大航线」，目标则是当上「海盗王」。航海王是一个依靠彼此坚毅的友情最终获得胜利，伙伴们一起朝着梦想扬帆努力的冒险故事"
  },
  {
   id: 1,
    img: require("@/assets/tv/tv1.webp"),
	zongyimg:require("@/assets/zy/zy4.webp"),
	filmimg:require("@/assets/film/film4.webp"),
	dmimg:require("@/assets/dm/dm4.webp"),
	V:require("@/assets/video/tv5.mp4"),
	zy:require("@/assets/zy/zy1.4.jpg"),
	dm:require("@/assets/dm/dm1.4.jpg"),
	film:require("@/assets/film/film1.4.jpg"),
    name: "狐妖小红娘月红篇",
	zongyname:"哈哈哈哈哈",
	filmname:"小马鞭",
	dmname:"贝肯熊",
    desc: "讲述了人与妖冲突不断的世界中,涂山狐族心怀大义的大当家涂山红红(杨幂 饰)一心冀望两方的平等和和平，为此，她携手人族乐方家族遗孤东方月初(龚俊 饰)，开启促成缔结人和妖之间的情缘任务，以此抵抗侵蚀庇护涂山上下的苦情树的暗黑力量，瓦解挑拨人和妖之间矛盾的暗黑势力。",
	zongydesc:"每年三个“怨种”兄弟邓超、陈赫、鹿晗，总会一起出门旅行。过往三年的国内壮游给了五哈旅行社迈向世界的信心，今年正式通知各位，旅行业务全面升级，出境游线路指日可待!带着“情比金坚”的兄弟们，和一肚子“坏水”的节目组，“真男人们”即将开始一场世界级的草率旅行...",
	filmdesc:"因种种原因，哈萨克小男孩昂萨尔一直没有一匹属于自己的马，直到某一天，爸爸的好友悄悄送来了一匹名叫飞来克的马。在与哥哥争夺骑马权的过程中，飞来克受伤了，在救治飞来克的过程中，昂萨尔不仅与飞来克建立了深厚的友情，同时也认识了一个名叫小美丽的小女孩，得知小美丽与爸爸的故事之后，昂萨尔决定骑着飞来克去完成小美丽寻找爸爸的梦想.",
	dmdesc:"《倒霉熊》是一部关于可爱的北极熊贝肯的幽默搞笑动画片，全集共分八大部和一个剧场版。其中的主角“倒霉熊”是韩国EBS电台制作的一个卡通形象。在相继推出了流氓兔、丁嘉猫之后，韩国的动画界一直致力于打造下一个有代表性的韩国卡通形象。片中的主人公是一个长在北极的胖胖的小熊，他的好奇心很强。他从遥远的北极来到了繁华的城市，从此便发生了很多令人啼笑皆非的故事。人们在开怀大笑的同时还会为倒霉熊的单纯而感动,"
	}
]

export default {
  getGoodsList(callback) {
    setTimeout(() => callback(data), 100)
  }
}
